t21/Walnut_X/Packages/.cache/Keil.STM32L4xx_DFP.1.2.0.pdsc
          <variant Dvariant="STM32L476RCTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L476VC'  ***************************** -->
        <device Dname="STM32L476VC">
          <memory id="IROM1"                         start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_256.FLM"  start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L476VCTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L476RE'  ***************************** -->
        <device Dname="STM32L476RE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L476RETx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L476JE'  ***************************** -->
        <device Dname="STM32L476JE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L476JEYx"> <feature type="CSP" n="72"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L476ME'  ***************************** -->
        <device Dname="STM32L476ME">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L476MEYx"> <feature type="CSP" n="81"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L476VE'  ***************************** -->
        <device Dname="STM32L476VE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L476VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L476QE'  ***************************** -->
        <device Dname="STM32L476QE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L476QEIx"> <feature type="BGA" n="132"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L476ZE'  ***************************** -->
        <device Dname="STM32L476ZE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L476ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L476RG'  ***************************** -->
        <device Dname="STM32L476RG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L476RGTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L476ZG'  ***************************** -->
        <device Dname="STM32L476ZG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L476ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L476JG'  ***************************** -->
        <device Dname="STM32L476JG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

