t21/Walnut_X/Packages/.cache/Keil.STM32L4xx_DFP.1.2.0.pdsc
          <variant Dvariant="STM32L486ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L431">
      <description>STMicroelectronics STM32L431 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L431*"/>
    </condition>
    <condition id="STM32L432">
      <description>STMicroelectronics STM32L432 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L432*"/>
    </condition>
    <condition id="STM32L433">
      <description>STMicroelectronics STM32L433 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L433*"/>
    </condition>
    <condition id="STM32L443">
      <description>STMicroelectronics STM32L443 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L443*"/>
    </condition>
    <condition id="STM32L471">
      <description>STMicroelectronics STM32L471 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L471*"/>
    </condition>
    <condition id="STM32L475">
      <description>STMicroelectronics STM32L475 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L475*"/>
    </condition>
    <condition id="STM32L476">
      <description>STMicroelectronics STM32L476 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L476*"/>
    </condition>
    <condition id="STM32L485">
      <description>STMicroelectronics STM32L485 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L485*"/>
    </condition>
    <condition id="STM32L486">
      <description>STMicroelectronics STM32L486 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L486*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32L431 CMSIS">
      <description>STMicroelectronics STM32L431 Devices and CMSIS-Core</description>
      <require condition="STM32L431"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L432 CMSIS">
      <description>STMicroelectronics STM32L432 Devices and CMSIS-Core</description>
      <require condition="STM32L432"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L433 CMSIS">
      <description>STMicroelectronics STM32L433 Devices and CMSIS-Core</description>
      <require condition="STM32L433"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L443 CMSIS">
      <description>STMicroelectronics STM32L443 Devices and CMSIS-Core</description>
      <require condition="STM32L443"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L471 CMSIS">
      <description>STMicroelectronics STM32L471 Devices and CMSIS-Core</description>
      <require condition="STM32L471"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L475 CMSIS">
      <description>STMicroelectronics STM32L475 Devices and CMSIS-Core</description>
      <require condition="STM32L475"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L476 CMSIS">
      <description>STMicroelectronics STM32L476 Devices and CMSIS-Core</description>
      <require condition="STM32L476"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L485 CMSIS">
      <description>STMicroelectronics STM32L485 Devices and CMSIS-Core</description>
      <require condition="STM32L485"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L486 CMSIS">
      <description>STMicroelectronics STM32L486 Devices and CMSIS-Core</description>
      <require condition="STM32L486"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup startup_stm32l431 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="STM32L431 CMSIS">
      <description>System Startup for STMicroelectronics STM32L431 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l431xx.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.1.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l432 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="STM32L432 CMSIS">
      <description>System Startup for STMicroelectronics STM32L432 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l432xx.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.1.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l433 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="STM32L433 CMSIS">
      <description>System Startup for STMicroelectronics STM32L433 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l433xx.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.1.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l443 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="STM32L443 CMSIS">
      <description>System Startup for STMicroelectronics STM32L443 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l443xx.s" attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.1.0"/>
      </files>
    </component>

