t21/Walnut_X/Packages/.cache/Keil.STM32L4xx_DFP.1.2.0.pdsc
    <!-- Startup startup_stm32l471 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="STM32L471 CMSIS">
      <description>System Startup for STMicroelectronics STM32L471 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l471xx.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.0.3"/>
      </files>
    </component>

    <!-- Startup startup_stm32l475 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="STM32L475 CMSIS">
      <description>System Startup for STMicroelectronics STM32L475 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l475xx.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.0.3"/>
      </files>
    </component>

    <!-- Startup startup_stm32l476 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="STM32L476 CMSIS">
      <description>System Startup for STMicroelectronics STM32L476 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l476xx.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.0.3"/>
      </files>
    </component>

    <!-- Startup startup_stm32l485 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="STM32L485 CMSIS">
      <description>System Startup for STMicroelectronics STM32L485 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l485xx.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.0.3"/>
      </files>
    </component>

    <!-- Startup startup_stm32l486 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="STM32L486 CMSIS">
      <description>System Startup for STMicroelectronics STM32L486 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l486xx.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.0.3"/>
      </files>
    </component>

    <!-- STM32L476G-EVAL Board Support -->
    <bundle Cbundle="STM32L476G-EVAL" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32L476G-EVAL Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32L476 CMSIS">
      <description>LED driver for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="source" name="Boards/ST/STM32L476G-EVAL/Common/LED_STM32L476G-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32L476 CMSIS">
      <description>Button driver for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
        <file category="sourceC" name="Boards/ST/STM32L476G-EVAL/Common/Buttons_STM32L476G-EVAL.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <!-- STM32L476G-EVAL Board Support -->
    <board vendor="STMicroelectronics" name="STM32L476G-EVAL" revision="Rev.A" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32L476G-EVAL</description>
      <image small="Boards/ST/STM32L476G-EVAL/Documentation/stm32l476g-eval_small.jpg"
             large="Boards/ST/STM32L476G-EVAL/Documentation/stm32l476g-eval_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/en/catalog/tools/PF261634" title="Web Page"/>
      <book category="schematic" name="Boards/ST/STM32L476G-EVAL/Documentation/MB1144B.pdf" title="Schematics"/>
      <book category="manual"    name="Boards/ST/STM32L476G-EVAL/Documentation/DM00155732.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L476ZG"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L476"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Tamper and User"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- STM32L476G-EVAL Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/ST/STM32L476G-EVAL/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32L476G-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
